---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleDefinition
source: html/297a76e9-5443-26de-bdb3-da69d3463753.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleDefinition Property

"Hole Definition"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemHoleDefinition { get; }
```